## Import the libary and read the file

In [108]:
import pandas as pd
BC = pd.read_csv("balance.csv") 
BC.head()

   Customer_ID Customer_Name Gender  Balance  Deposite
0            1            Ah      F      500        80
1            2            Ab      F      340        82
2            3            Ah      F     3000        81
3            4            Ab      M      200       120
4            5            Ah      M      120       300

## show the head of the file first 5 culoms

In [109]:
BC.head()

   Customer_ID Customer_Name Gender  Balance  Deposite
0            1            Ah      F      500        80
1            2            Ab      F      340        82
2            3            Ah      F     3000        81
3            4            Ab      M      200       120
4            5            Ah      M      120       300

## show the last 5 culoms

In [110]:
BC.tail()

    Customer_ID Customer_Name Gender  Balance  Deposite
33           34            Ab      F     3000        64
34           35            Ah      F      200        67
35           36            Ab      F      120        67
36           37            Ah      M      500        68
37           38            Ab      F      123        70

## print the first 4 items we use .head

In [111]:
BC.head(4)

   Customer_ID Customer_Name Gender  Balance  Deposite
0            1            Ah      F      500        80
1            2            Ab      F      340        82
2            3            Ah      F     3000        81
3            4            Ab      M      200       120

## print the last 10 items we use .tail

In [112]:
BC.tail(10)

    Customer_ID Customer_Name Gender  Balance  Deposite
28           29            Ah      F      200        65
29           30            Ab      F      120        67
30           31            Ah      F      500        66
31           32            Ab      F      123        67
32           33            Ah      F      435        65
33           34            Ab      F     3000        64
34           35            Ah      F      200        67
35           36            Ab      F      120        67
36           37            Ah      M      500        68
37           38            Ab      F      123        70

## change the name of colums
# Customer_ID to ID

In [113]:
BC.head()

   Customer_ID Customer_Name Gender  Balance  Deposite
0            1            Ah      F      500        80
1            2            Ab      F      340        82
2            3            Ah      F     3000        81
3            4            Ab      M      200       120
4            5            Ah      M      120       300

In [114]:
BC.rename(columns= {"Customer_ID" : "ID"}, inplace=True)
BC.head()

   ID Customer_Name Gender  Balance  Deposite
0   1            Ah      F      500        80
1   2            Ab      F      340        82
2   3            Ah      F     3000        81
3   4            Ab      M      200       120
4   5            Ah      M      120       300

In [115]:
BC.head()

   ID Customer_Name Gender  Balance  Deposite
0   1            Ah      F      500        80
1   2            Ab      F      340        82
2   3            Ah      F     3000        81
3   4            Ab      M      200       120
4   5            Ah      M      120       300

## Remove a specific Columns
# delete the coloum Gemder

In [116]:
BC1 = BC.drop(["Customer_Name"], axis=1)
BC1.head()

   ID Gender  Balance  Deposite
0   1      F      500        80
1   2      F      340        82
2   3      F     3000        81
3   4      M      200       120
4   5      M      120       300

In [117]:
BC.head()

   ID Customer_Name Gender  Balance  Deposite
0   1            Ah      F      500        80
1   2            Ab      F      340        82
2   3            Ah      F     3000        81
3   4            Ab      M      200       120
4   5            Ah      M      120       300

In [118]:
BC1.head()

   ID Gender  Balance  Deposite
0   1      F      500        80
1   2      F      340        82
2   3      F     3000        81
3   4      M      200       120
4   5      M      120       300

## Perform arithmetic operations on the df
# create a new colum that contains the sum of the Balance and Deposite

In [119]:
BC["Total Balance"]= BC["Balance"]+BC["Deposite"]
BC.head()

   ID Customer_Name Gender  Balance  Deposite  Total Balance
0   1            Ah      F      500        80            580
1   2            Ab      F      340        82            422
2   3            Ah      F     3000        81           3081
3   4            Ab      M      200       120            320
4   5            Ah      M      120       300            420

## Find statistical measures (mean , median , mode)
# Find the mean of the Balance

In [120]:
av = BC["Balance"].mean()
av

1611.0

# Find the median of the Balance

In [121]:
av = BC["Balance"].median()
av

387.5

# Find the mode of the Balance

In [122]:
av = BC["Balance"].mode(0)
av

0    500
Name: Balance, dtype: int64

## Find the std ,min , Max
# find the std of Total

In [123]:
st = BC["Total Balance"].std()
st

5577.665516103542

# find the Min of Total

In [124]:
st = BC["Total Balance"].min()
st

186

# find the Max of Total

In [125]:
st = BC["Total Balance"].max()
st

34615

## Examples
# add 3 percent to the total amounts

In [126]:
BC.head()

   ID Customer_Name Gender  Balance  Deposite  Total Balance
0   1            Ah      F      500        80            580
1   2            Ab      F      340        82            422
2   3            Ah      F     3000        81           3081
3   4            Ab      M      200       120            320
4   5            Ah      M      120       300            420

In [127]:
BC["Total Balance"]=BC["Total Balance"]+0.03*BC["Total Balance"]
BC.head()

   ID Customer_Name Gender  Balance  Deposite  Total Balance
0   1            Ah      F      500        80         597.40
1   2            Ab      F      340        82         434.66
2   3            Ah      F     3000        81        3173.43
3   4            Ab      M      200       120         329.60
4   5            Ah      M      120       300         432.60

## Add or Subtract
# Add to the Total

In [128]:
BC["Total Balance"]= BC["Total Balance"] - 0.8
BC.head()

   ID Customer_Name Gender  Balance  Deposite  Total Balance
0   1            Ah      F      500        80         596.60
1   2            Ab      F      340        82         433.86
2   3            Ah      F     3000        81        3172.63
3   4            Ab      M      200       120         328.80
4   5            Ah      M      120       300         431.80

# Subtract from the Total 0.5

In [129]:
BC["Total Balance"]= BC["Total Balance"] - 0.5
BC.head()

   ID Customer_Name Gender  Balance  Deposite  Total Balance
0   1            Ah      F      500        80         596.10
1   2            Ab      F      340        82         433.36
2   3            Ah      F     3000        81        3172.13
3   4            Ab      M      200       120         328.30
4   5            Ah      M      120       300         431.30

## Count

In [130]:
BC.count()

ID               38
Customer_Name    38
Gender           38
Balance          38
Deposite         38
Total Balance    38
dtype: int64

## Extract Specific data
# Find the records of females

In [131]:
BC_F = BC[BC["Gender"]=="F"]

In [132]:
BC_F

    ID Customer_Name Gender  Balance  Deposite  Total Balance
0    1            Ah      F      500        80         596.10
1    2            Ab      F      340        82         433.36
2    3            Ah      F     3000        81        3172.13
5    6            Ab      F      500        80         596.10
6    7            Ah      F      123        80         207.79
7    8            Ab      F      435        81         530.18
11  12            Ab      F      120        71         195.43
12  13            Ah      F      500        72         587.86
13  14            Ab      F      123        76         203.67
14  15            Ah      F      435        76         525.03
15  16            Ab      F     3000        75        3165.95
19  20            Ab      F      123        82         209.85
21  22            Ab      F     3000        54        3144.32
22  23            Ah      F      200        60         266.50
26  27            Ah      F      435        70         518.85
28  29            Ah      F      200        65         271.65
29  30            Ab      F      120        67         191.31
30  31            Ah      F      500        66         581.68
31  32            Ab      F      123        67         194.40
32  33            Ah      F      435        65         513.70
33  34            Ab      F     3000        64        3154.62
34  35            Ah      F      200        67         273.71
35  36            Ab      F      120        67         191.31
37  38            Ab      F      123        70         197.49

## Find the avearg Balance of the main customers

In [133]:
BC_M = BC[BC["Gender"]=="M"]

In [134]:
BC_M

    ID Customer_Name Gender  Balance  Deposite  Total Balance
3    4            Ab      M      200       120         328.30
4    5            Ah      M      120       300         431.30
8    9            Ah      M    34545        70       35652.15
9   10            Ab      M     3000        77        3168.01
10  11            Ah      M      200        81         288.13
16  17            Ah      M      200        80         287.10
17  18            Ab      M      120        67         191.31
18  19            Ah      M      500        66         581.68
20  21            Ah      M      435        72         520.91
23  24            Ab      M      120        66         190.28
24  25            Ah      M      500        66         581.68
25  26            Ab      M      123        66         193.37
27  28            Ab      M     3000        72        3162.86
36  37            Ah      M      500        68         583.74

## The Avarage code

In [136]:
av1 = BC_M["Balance"].mean()
av1

3111.6428571428573